In [1]:
import pandas as pd
import numpy as np
person={
    'age':[20,30,50],
    'salary':[10000,2000,50000],
    
    
}
dt=pd.DataFrame(person)
dt

   age  salary
0   20   10000
1   30    2000
2   50   50000

In [2]:
#normalization
dt['age']=dt['age']/dt['age'].max()
dt['salary']=dt['salary']/dt['salary'].max()

In [3]:
dt

   age  salary
0  0.4    0.20
1  0.6    0.04
2  1.0    1.00

In [4]:
import pandas as pd
import numpy as np
person={
    'age':[20,30,50],
    'salary':[10000,2000,50000],
    
    
}
dt=pd.DataFrame(person)
dt

   age  salary
0   20   10000
1   30    2000
2   50   50000

In [1]:
import pandas as pd
import numpy as np
person={
    'age':[20,30,50],
    'salary':[10000,2000,50000],
    
    
}
dt=pd.DataFrame(person)
dt

   age  salary
0   20   10000
1   30    2000
2   50   50000

In [3]:
dt['age']=(dt['age']-dt['age'].min())/(dt['age'].max()-dt['age'].min())
dt['salary']=(dt['salary']-dt['salary'].min())/(dt['salary'].max()-dt['salary'].min())

In [4]:
dt

        age    salary
0  0.000000  0.166667
1  0.333333  0.000000
2  1.000000  1.000000